#include <stdio.h>
#include <locale.h>//библиотека с языками, без нее русский не шуршит
int main() {
	setlocale(LC_ALL, "rus");//тут русский надо включить без него никак
	int age;
	printf("Введите возраст\n");//тут принт нужен потому что так надо
	scanf_s("%d", &age);//scanf_s ибо подругому никак, но можно и scanf но не надо, еще & нет
	if (age < 14)
		printf("%d - детство\n", age);//в конце строки всегда точка с запятой, ну почти всегда, а так не всегда вот
	else if (14 <= age && age< 25)// условие с двойным неравенством тоько через &&
		printf("%d - молодость\n", age);//%d, а не %f
	else if (25 <= age && age < 60)// лишняя ;
		printf("%d - зрелость\n", age);//%d, а не %f
	else
		printf("%d - старость\n", age);
	system("pause");//пауза чтобы успеть почитать 
	return 0;
}